{
    "metadata": {
        "title": "Terms of Service",
        "lastUpdated": "January 18, 2026",
        "contactEmail": "contact@trustreet.ai",
        "companyName": "Trustreet"
    },
    "header": {
        "title": "Terms of Service",
        "subtitle": "Please read these Terms of Service carefully before using the Trustreet platform. By accessing or using our services, you agree to be bound by these terms."
    },
    "sections": [
        {
            "title": "Acceptance of Terms",
            "content": [
                "By accessing or using the Trustreet platform ('Service'), you agree to comply with and be bound by these Terms of Service ('Terms'). If you do not agree to these Terms, please do not use our Service.",
                "We reserve the right to modify these Terms at any time. We will notify you of material changes by posting the updated Terms on our platform and updating the 'Last Updated' date. Your continued use of the Service after such changes constitutes acceptance of the modified Terms.",
                "These Terms apply to all users of the Service, including investors, browsers, and any other visitors to the platform."
            ]
        },
        {
            "title": "Eligibility and Account Registration",
            "content": [
                "You must be at least 18 years of age to use this Service. By using the Service, you represent and warrant that you meet this age requirement.",
                "To access certain features, you may be required to create an account. You agree to:",
                "• Provide accurate, current, and complete information during registration",
                "• Maintain and promptly update your account information",
                "• Maintain the security of your account credentials",
                "• Accept responsibility for all activities that occur under your account",
                "• Notify us immediately of any unauthorized use of your account",
                "We reserve the right to suspend or terminate accounts that violate these Terms or provide false information."
            ]
        },
        {
            "title": "Investment Services and Risks",
            "content": [
                "Trustreet provides a platform for real estate investment opportunities. Important disclaimers:",
                "• All investments carry risk, including the potential loss of principal",
                "• Past performance does not guarantee future results",
                "• Property values and rental income may fluctuate",
                "• Investment opportunities are subject to availability and may be withdrawn at any time",
                "• AI-generated scores and projections are estimates based on historical data and market analysis, not guarantees",
                "• We do not provide personalized investment advice or recommendations",
                "You are solely responsible for evaluating the suitability of any investment opportunity presented on our platform. We strongly recommend consulting with qualified financial, tax, and legal advisors before making investment decisions.",
                "Certain investment opportunities may only be available to accredited investors as defined by applicable securities regulations."
            ]
        },
        {
            "title": "Platform Usage and Restrictions",
            "content": [
                "You agree to use the Service only for lawful purposes and in accordance with these Terms. You agree NOT to:",
                "• Use the Service in any way that violates applicable laws or regulations",
                "• Impersonate any person or entity or misrepresent your affiliation",
                "• Engage in fraudulent activities or provide false information",
                "• Attempt to gain unauthorized access to any part of the Service",
                "• Interfere with or disrupt the Service or servers",
                "• Use automated tools (bots, scrapers) to access the Service without permission",
                "• Upload or transmit viruses, malware, or other malicious code",
                "• Collect or harvest personal information of other users",
                "• Use the Service for any commercial purpose without our written consent",
                "Violation of these restrictions may result in immediate termination of your account and legal action."
            ]
        },
        {
            "title": "Intellectual Property Rights",
            "content": [
                "All content on the Trustreet platform, including text, graphics, logos, images, software, data compilations, and AI algorithms, is the property of Trustreet or its licensors and is protected by copyright, trademark, and other intellectual property laws.",
                "You are granted a limited, non-exclusive, non-transferable license to access and use the Service for personal, non-commercial purposes. This license does not include the right to:",
                "• Reproduce, distribute, or modify any content without written permission",
                "• Use our trademarks, service marks, or branding without authorization",
                "• Reverse engineer, decompile, or disassemble any software or AI algorithms",
                "• Create derivative works based on our platform or content",
                "Any unauthorized use of our intellectual property may result in legal action and damages."
            ]
        },
        {
            "title": "Transaction Terms and Fees",
            "content": [
                "When you engage in transactions through our platform:",
                "• All transactions are binding and non-refundable unless otherwise specified",
                "• You are responsible for paying all applicable fees, including platform fees, transaction fees, and any third-party charges",
                "• Fees are subject to change with reasonable notice",
                "• Payment processing is handled by third-party providers subject to their terms",
                "• We reserve the right to refuse or cancel any transaction at our discretion",
                "Detailed fee schedules and transaction terms are provided during the investment process. Please review all terms carefully before completing any transaction."
            ]
        },
        {
            "title": "Third-Party Services and Links",
            "content": [
                "Our Service may contain links to third-party websites or integrate with third-party services (payment processors, data providers, analytics tools). These third parties are not under our control, and we are not responsible for:",
                "• The content, privacy policies, or practices of third-party services",
                "• Any damages or losses caused by third-party services",
                "• The availability or accuracy of third-party information",
                "Your use of third-party services is at your own risk and subject to their respective terms and conditions. We encourage you to review the terms of any third-party services you use."
            ]
        },
        {
            "title": "Disclaimers and Limitation of Liability",
            "content": [
                "THE SERVICE IS PROVIDED 'AS IS' AND 'AS AVAILABLE' WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO:",
                "• Warranties of merchantability, fitness for a particular purpose, or non-infringement",
                "• Warranties regarding accuracy, reliability, or completeness of content",
                "• Warranties that the Service will be uninterrupted, secure, or error-free",
                "TO THE MAXIMUM EXTENT PERMITTED BY LAW, TRUSTREET SHALL NOT BE LIABLE FOR:",
                "• Any indirect, incidental, special, consequential, or punitive damages",
                "• Loss of profits, revenue, data, or investment opportunities",
                "• Damages resulting from your use or inability to use the Service",
                "• Damages resulting from third-party content or services",
                "• Any claims exceeding the amount you paid to Trustreet in the 12 months preceding the claim",
                "Some jurisdictions do not allow the exclusion of certain warranties or limitations of liability, so these limitations may not apply to you."
            ]
        },
        {
            "title": "Indemnification",
            "content": [
                "You agree to indemnify, defend, and hold harmless Trustreet, its officers, directors, employees, agents, and affiliates from and against any claims, liabilities, damages, losses, costs, or expenses (including reasonable attorneys' fees) arising from:",
                "• Your use or misuse of the Service",
                "• Your violation of these Terms",
                "• Your violation of any rights of another party",
                "• Any fraudulent or illegal activities conducted through your account",
                "We reserve the right to assume exclusive defense and control of any matter subject to indemnification, and you agree to cooperate with our defense of such claims."
            ]
        },
        {
            "title": "Termination",
            "content": [
                "We reserve the right to suspend or terminate your access to the Service at any time, with or without cause, and with or without notice, for any reason including:",
                "• Violation of these Terms",
                "• Fraudulent or illegal activity",
                "• Failure to pay applicable fees",
                "• At your request",
                "• For any other reason at our sole discretion",
                "Upon termination, your right to use the Service will immediately cease. Sections of these Terms that by their nature should survive termination shall survive, including intellectual property rights, disclaimers, indemnification, and dispute resolution provisions.",
                "You may terminate your account at any time by contacting us at contact@trustreet.ai."
            ]
        },
        {
            "title": "Governing Law and Dispute Resolution",
            "content": [
                "These Terms shall be governed by and construed in accordance with the laws of the United States, without regard to conflict of law principles.",
                "Any disputes arising from these Terms or your use of the Service shall be resolved through binding arbitration in accordance with the rules of the American Arbitration Association, except that:",
                "• Either party may seek injunctive relief in court for intellectual property violations",
                "• Small claims may be brought in small claims court",
                "You agree to waive any right to a jury trial or to participate in a class action lawsuit. All arbitration proceedings shall be conducted on an individual basis.",
                "If any provision of this arbitration agreement is found unenforceable, the remainder shall remain in full force and effect."
            ]
        },
        {
            "title": "General Provisions",
            "content": [
                "Entire Agreement: These Terms constitute the entire agreement between you and Trustreet regarding the Service and supersede all prior agreements.",
                "Severability: If any provision of these Terms is found invalid or unenforceable, the remaining provisions will remain in full force and effect.",
                "Waiver: Our failure to enforce any right or provision in these Terms shall not constitute a waiver of such right or provision.",
                "Assignment: You may not assign or transfer these Terms without our written consent. We may assign these Terms without restriction.",
                "Force Majeure: We shall not be liable for any failure to perform our obligations due to circumstances beyond our reasonable control, including natural disasters, war, terrorism, pandemics, or government actions.",
                "Notices: All notices to Trustreet should be sent to contact@trustreet.ai. We may provide notices to you via email or through the Service.",
                "Language: These Terms are written in English. Any translations are provided for convenience only, and the English version shall prevail in case of conflict."
            ]
        },
        {
            "title": "Contact Information",
            "content": [
                "If you have any questions, concerns, or disputes regarding these Terms of Service, please contact us:",
                "• Email: contact@trustreet.ai",
                "• Phone: 1-800-555-0123",
                "We will make reasonable efforts to respond to your inquiries promptly and resolve any issues in good faith."
            ]
        }
    ]
}